## Plan 📝
```bash
google_storage_bucket.terraform_state_bucket: Refreshing state... [id=apsitvarkom-dev-bucket-tfstate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.docker_repo will be created
  + resource "google_artifact_registry_repository" "docker_repo" {
      + create_time   = (known after apply)
      + description   = "Docker repository for storing images of apsitvarkom (dev) services"
      + format        = "docker"
      + id            = (known after apply)
      + location      = "us-east1"
      + name          = (known after apply)
      + project       = (known after apply)
      + repository_id = "docker-apsitvarkom-dev"
      + update_time   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentplan -->